# #Задание 1

# dictionary_1 = {'a': 300, 'b': 400}
# dictionary_2 = {'c': 500, 'd': 600}
# dictionary_1.update(dictionary_2)
# print(dictionary_1)

# #задание 2
# numbers = {"num_1" : 1, "num_2" : 2,"num_3" : 3, "num_100" : 100}
# for num in range(1,101):
  



# # задание 3


# student = {"name" : "Askhat", "age" : 17} 
# print( 17 * 2)   #чисто тут нашла легкий вариант

# #задание 4 
# student = {"name" : "Askhat", "age" : 17,"color" : "White"}
# student["age"] = 16
# print(student)

# #задание 5 
# student = {"name" : "Askhat", "age" : 17}
# student.pop("age")
# print(student)


# #задание 6

# student = {"name" : "Askhat"}
# student.setdefault("address", "Западный Анар")
# print(student)

#доп  Напишите программу, которая имитирует проверку пароля, придуманного
# пользователем. Пользователь вводит пароль, а потом ещё раз его же, для
# подтверждения.
# И пароль который вводит пользователь записывается в пустое множество после
# проверок
# Если первый пароль, который ввел пользователь короче 8 символов, программа
# выводит на экран слово "Короткий пароль!"
# Если же первый пароль достаточно длинный, но в нём содержится сочетание
# символов "123", программа выводит на экран слово "Простой пароль!"
# Если же предыдущие проверки пройдены успешно, но введённые слова-пароли
# не совпадают, то программа выводит на экран слово "Различаются."
# Если же и третья проверка пройдена успешно, программа выводит "OK"
# (латинскими буквами) и выводит “Пароль создан!”

